age-of-code-api/app/controllers/api/v1/actions_controller.rb

SELECT "actions".* FROM "actions"
---
  def index
    @actions = Action.all