age-of-code-api/app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "experience" = $1, "permissions" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["experience", 200], ["permissions", "11110100000"], ["updated_at", "2018-06-01 16:17:22.745864"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)